module.exports = {
  env: {
      browser: true,
      es6: true,
      node: true,
  },
  extends: [
  'eslint:recommended',
  "plugin:@typescript-eslint/recommended",
  "plugin:react/recommended",
],
  parser: '@typescript-eslint/parser',
  parserOptions: {
      ecmaFeatures: {
          jsx: true,
      },
      ecmaVersion: 11,
      sourceType: 'module',
  },
  settings: {
      "import/resolver": {
          "babel-plugin-root-import": {
              "rootPathSuffix": "app",
              "rootPathPrefix": "~"
          },
          "node": {
              "extensions": [
                  ".js",
                  ".jsx",
                  ".ts",
                  ".tsx"
              ]
          }
      },
  },
  globals: {
      "ios": false,
      "android": false,
      "windowHeight": false,
      "windowWidth": false,
      "hairlineWidth": false,
      "DeviceInfo": false,
      "isIphoneX": false,
      "StatusBarHeight": false,
      "HeaderHeight": false,
      Atomics: 'readonly',
      SharedArrayBuffer: 'readonly',
  },
  plugins: ['react', "react-native", '@typescript-eslint'],
  rules: {
      'no-console': "error",
      // we only want single quotes
      quotes: ['error', 'single'],
     //eqeqeq: ['error', 'always'], // ==! === РІРјРµСЃС‚Рѕ == =!
      'no-else-return': ['error', { allowElseIf: true }], // if else
      camelcase: ['error', { properties: 'always' }],
      //'block-spacing': 'error', // РѕС‚СЃС‚СѓРїС‹ РІ Р±Р»РѕРєР°С…
      'brace-style': ['error', '1tbs'], // СЃРєРѕР±РєРё РїРµСЂРµРЅРѕСЃСЏС‚СЃСЏ
      'comma-spacing': ['error', { before: false, after: true }], // РѕС‚СЃС‚СѓРїС‹ РїРµСЂРµРґ Рё РїРѕСЃР»Рµ Р·Р°РїСЏС‚С‹С…
      'comma-style': ['error', 'last'], // РїРµСЂРµРЅРѕСЃ Р·Р°РїСЏС‚РѕР№
      'comma-dangle': ['error', 'always-multiline'], // РїРѕСЃР»РµРґРЅСЏСЏ Р·Р°РїСЏС‚Р°СЏ !!!
      'key-spacing': ["error", { "afterColon": true, }], // РїСЂРѕР±РµР» РїРѕСЃР»Рµ РґРІРѕРµС‚РѕС‡РёРµ РєР»СЋС‡Р° РІ РѕР±СЉРµРєС‚Рµ, С‚Р°Рє Р¶Рµ РјРѕР¶РЅРѕ РґРѕР±Р°РІРёС‚СЊ beforeColon
      'arrow-spacing': ["error", {"before": true, "after": true} ], // () => {}    
      'arrow-body-style': ["error", "as-needed"], // СЂРµРґР°РєС‚РёСЂСѓРµС‚ () => {} РїРѕ РЅРµРѕР±С…РѕРґРёРјРѕСЃС‚Рё
      'no-trailing-spaces': "error", // РїСѓСЃС‚С‹Рµ РїСЂРѕР±РµР»С‹
      'no-multiple-empty-lines': ["error", { "max": 1, "maxEOF": 1 }],  // СѓРґР°Р»СЏРµРј РїСѓСЃС‚С‹Рµ СЃС‚СЂРѕРєРё
      // 'array-bracket-newline': ["error", "always"], // РѕС‚РєСЂС‹РІР°СЋС‰РёРµ Рё Р·Р°РєСЂС‹РІР°СЋС‰РёРµ СЃРєРѕР±РєРё СЃ РЅРѕРІРѕР№ СЃС‚СЂРѕРєРё
      // 'object-property-newline': ["error", {'allowAllPropertiesOnSameLine': false}], //

      "no-param-reassign": [
          "error",
          {
              "props": false
          }
      ],
      "no-restricted-globals": "off",
      "no-unused-expressions": ["warn", { "allowShortCircuit": true, "allowTernary": false }],
      "prefer-destructuring": [
          "error",
          {
              "array": false,
              "object": true
          }
      ],
  
      "max-classes-per-file": "warn",
      "import/prefer-default-export": "off",
      "react/prefer-stateless-function": "error",
      "react/destructuring-assignment": "warn",
      "react/prop-types": "off",
      "react/react-in-jsx-scope": "off",
      "react/jsx-props-no-spreading": "off",
      "react/jsx-filename-extension": [
          "error",
          {
              "extensions": [
                  ".jsx",
                  ".tsx"
              ]
          }
      ],
      "jsx-a11y/accessible-emoji": "off",
      // "react/static-property-placement": "off",
      // "react-native/no-color-literals": "off",
      // "react-native/no-raw-text": "off",
      // "react-native/no-inline-styles": "off",
      // "react-native/split-platform-components": "off",
      // "@typescript-eslint/explicit-member-accessibility": [
      //     "error",
      //     {
      //         "accessibility": "no-public"
      //     }
      // ],
      // "@typescript-eslint/no-empty-interface": "warn",
      // "@typescript-eslint/explicit-function-return-type": [
      //     "off",
      //     {
      //         "allowExpressions": true,
      //         "allowTypedFunctionExpressions": true
      //     }
      // ],
      // "@typescript-eslint/no-explicit-any": "off",
       "@typescript-eslint/no-use-before-define": "off",
       
      //    [ "error",
      //     {
      //         "functions": true,
      //         "classes": true,
      //         "variables": false
      //     }
      // ],
      // "@typescript-eslint/no-unused-vars": [
      //     "warn",
      //     {
      //         "args": "none"
      //     }
      // ],
      "space-infix-ops": "error",
      // "@typescript-eslint/no-inferrable-types": "off",
      // "@typescript-eslint/no-non-null-assertion": "off",
      // "@typescript-eslint/camelcase": "off",
      // "@typescript-eslint/ban-ts-ignore": "off",
      "object-curly-newline": "off", // РќРµСЃРѕРІРјРµСЃС‚РёРјРѕ СЃ prettier
      "no-mixed-operators": "off", // РќРµСЃРѕРІРјРµСЃС‚РёРјРѕ СЃ prettier
      "function-paren-newline": "off", // РќРµСЃРѕРІРјРµСЃС‚РёРјРѕ СЃ prettier
      "no-plusplus": "off", // РќРµСЃРѕРІРјРµСЃС‚РёРјРѕ СЃ prettier
      "space-before-function-paren": "off", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ РїСЂРѕР±РµР» РїРµСЂРµРґ РѕС‚РєСЂС‹С‚РёРµРј СЃРєРѕР±РѕРє С„СѓРЅРєС†РёРё
      "max-len": [
          "error",
          150,
          2,
          {
              "ignoreUrls": true
          }
      ], // СѓРєР°Р¶РёС‚Рµ РјР°РєСЃРёРјР°Р»СЊРЅСѓСЋ РґР»РёРЅСѓ СЃС‚СЂРѕРєРё РІ РІР°С€РµР№ РїСЂРѕРіСЂР°РјРјРµ
      "semi": [
          "error",
          "always"
      ], // С‚СЂРµР±СѓРµС‚ С‚РѕС‡РєРё СЃ Р·Р°РїСЏС‚РѕР№ РІ РєРѕРЅС†Рµ РѕРїРµСЂР°С‚РѕСЂРѕРІ
      "semi-spacing": [
          "error",
          {
              "before": false,
              "after": false
          }
      ], // Р­С‚РѕС‚ РїР°СЂР°РјРµС‚СЂ СѓСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ РёРЅС‚РµСЂРІР°Р» РїРµСЂРµРґ С‚РѕС‡РєРѕР№ СЃ Р·Р°РїСЏС‚РѕР№ Рё Р·Р°РїСЂРµС‰Р°РµС‚ РёРЅС‚РµСЂРІР°Р» РїРѕСЃР»Рµ С‚РѕС‡РєРё СЃ Р·Р°РїСЏС‚РѕР№
      
      "no-compare-neg-zero": "error", // Р—Р°РїСЂРµС‰Р°РµС‚ СЃСЂР°РІРЅРµРЅРёРµ СЃ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹Рј РЅСѓР»РµРј
      "no-cond-assign": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РЅРµРѕРґРЅРѕР·РЅР°С‡РЅС‹Рµ РѕРїРµСЂР°С‚РѕСЂ РїСЂРёСЃРІР°РёРІР°РЅРёСЏ РІ С‚РµСЃС‚РѕРІС‹С… СѓСЃР»РѕРІРёСЏС… if, for, whileРё do...while 
      "no-constant-condition": [
          "error",
          {
              "checkLoops": false
          }
      ], //Р­С‚Рѕ РїСЂР°РІРёР»Рѕ Р·Р°РїСЂРµС‰Р°РµС‚ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РєРѕРЅСЃС‚Р°РЅС‚РЅС‹С… РІС‹СЂР°Р¶РµРЅРёР№ РІ СѓСЃР»РѕРІРёСЏС… С‚РµСЃС‚Р°:if, for, while РР»Рё do...while, ?: С‚РµСЂРЅР°СЂРєР°
      "no-dupe-args": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РґСѓР±Р»РёСЂРѕРІР°РЅРёРµ РёРјРµРЅ РїР°СЂР°РјРµС‚СЂРѕРІ РІ РѕР±СЉСЏРІР»РµРЅРёСЏС… С„СѓРЅРєС†РёР№ РёР»Рё РІС‹СЂР°Р¶РµРЅРёСЏС…. Р­С‚Рѕ РЅРµ РѕС‚РЅРѕСЃРёС‚СЃСЏ Рє С„СѓРЅРєС†РёСЏРј СЃС‚СЂРµР»РѕРє РёР»Рё РјРµС‚РѕРґР°Рј РєР»Р°СЃСЃР°
      "no-dupe-else-if": "error", // СЌС‚Рѕ РїСЂР°РІРёР»Рѕ Р·Р°РїСЂРµС‰Р°РµС‚ РґСѓР±Р»РёСЂРѕРІР°РЅРёРµ СѓСЃР»РѕРІРёР№ РІ РѕРґРЅРѕР№ 
      "no-dupe-keys": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РґСѓР±Р»РёСЂРѕРІР°РЅРёРµ РєР»СЋС‡РµР№ РІ Р»РёС‚РµСЂР°Р»Р°С… РѕР±СЉРµРєС‚Р°
      "no-duplicate-case": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РґСѓР±Р»РёСЂРѕРІР°РЅРёРµ С‚РµСЃС‚РѕРІС‹С… РІС‹СЂР°Р¶РµРЅРёР№ РІ case РїСЂРµРґР»РѕР¶РµРЅРёСЏС… switch РѕРїРµСЂР°С‚РѕСЂРѕРІ
      "for-direction": "error", // РЅРµ РїРѕР·РІРѕР»СЏРµС‚ СѓСЃС‚Р°РЅРѕРІРёС‚СЊ Р±РµСЃРєРѕРЅРµС‡РЅС‹Р№ С†РёРєР» for
      "no-empty": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РїСѓСЃС‚С‹Рµ РѕРїРµСЂР°С‚РѕСЂС‹ Р±Р»РѕРєР°. Р­С‚Рѕ РїСЂР°РІРёР»Рѕ РёРіРЅРѕСЂРёСЂСѓРµС‚ РѕРїРµСЂР°С‚РѕСЂС‹ Р±Р»РѕРєР°, РєРѕС‚РѕСЂС‹Рµ СЃРѕРґРµСЂР¶Р°С‚ РєРѕРјРјРµРЅС‚Р°СЂРёР№ y
      "no-func-assign": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РїРµСЂРµРѕРїСЂРµРґРµР»РµРЅРёРµ С„-С†РёР№ РґРѕ РёС… РѕР±СЉСЏРІР»РµРЅРёСЏ
      "no-import-assign": "error", // РїСЂРµРґСѓРїСЂРµР¶РґР°РµС‚ РїРµСЂРµРѕРїСЂРµРґРµР»РµРЅРёСЏ, РїСЂРёСЂР°С‰РµРЅРёСЏ Рё СѓР±С‹РІР°РЅРёСЏ РёРјРїРѕСЂС‚РёСЂРѕРІР°РЅРЅС‹С… РґР°РЅРЅС‹С… 
      "no-sparse-arrays": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ Р»РёС‚РµСЂР°Р»РѕРІ СЂР°Р·СЂРµР¶РµРЅРЅС‹С… РјР°СЃСЃРёРІРѕРІ, РёРјРµСЋС‰РёС… В«РґС‹СЂС‹В», РІ РєРѕС‚РѕСЂС‹С… РїРµСЂРµРґ Р·Р°РїСЏС‚С‹РјРё РЅРµ СЃС‚РѕСЏС‚ СЌР»РµРјРµРЅС‚С‹ 
      "no-template-curly-in-string": "error", // РїСЂРµРґСѓРїСЂРµР¶РґРµРЅРёРµ, РєРѕРіРґР° РѕР±С‹С‡РЅР°СЏ СЃС‚СЂРѕРєР° СЃРѕРґРµСЂР¶РёС‚ С‚Рѕ, С‡С‚Рѕ РІС‹РіР»СЏРґРёС‚ РєР°Рє Р·Р°РїРѕР»РЅРёС‚РµР»СЊ Р»РёС‚РµСЂР°Р»Р° С€Р°Р±Р»РѕРЅР° (""->``) 
      "no-unexpected-multiline": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РІРІРѕРґРёС‚СЊ РІ Р·Р°Р±Р»СѓР¶РґРµРЅРёРµ РјРЅРѕРіРѕСЃС‚СЂРѕС‡РЅС‹Рµ РІС‹СЂР°Р¶РµРЅРёСЏ 
      "no-unreachable": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РЅРµРґРѕСЃС‚РёР¶РёРјС‹Р№ РєРѕРґ РїРѕСЃР»Рµ return, throw, continue Рё break 
      "valid-typeof": "error", // С‚СЂРµР±СѓРµС‚, С‡С‚РѕР±С‹ typeof РІС‹СЂР°Р¶РµРЅРёСЏ СЃСЂР°РІРЅРёРІР°Р»РёСЃСЊ С‚РѕР»СЊРєРѕ СЃРѕ СЃС‚СЂРѕРєРѕРІС‹РјРё Р»РёС‚РµСЂР°Р»Р°РјРё РёР»Рё РґСЂСѓРіРёРјРё typeof РІС‹СЂР°Р¶РµРЅРёСЏРјРё, Рё Р·Р°РїСЂРµС‰Р°РµС‚ СЃСЂР°РІРЅРµРЅРёРµ СЃ Р»СЋР±С‹Рј РґСЂСѓРіРёРј Р·РЅР°С‡РµРЅРёРµРј (error is strign or nunber) 
      "use-isnan": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ СЃСЂР°РІРЅРµРЅРёРµ СЃ В«NaNВ» С‡РµСЂРµР· ===. РўРѕР»СЊРєРѕ isNaN
      "no-extra-boolean-cast": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РЅРµРЅСѓР¶РЅС‹Рµ Р»РѕРіРёС‡РµСЃРєРёРµ РїСЂРµРѕР±СЂР°Р·РѕРІР°РЅРёСЏ 
      //*** Best Practices ***//
      "array-callback-return": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РјРµС‚РѕРґРѕРІ С„РёР»СЊС‚СЂР°С†РёРё РјР°СЃСЃРёРІРѕРІ Р±РµР· return (from, every, filter, find, findIndex, map, reduce, reduceRight, some, sort). Р•СЃР»Рё РІС‹ РЅРµ С…РѕС‚РёС‚Рµ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РІРѕР·РІСЂР°С‚, РёСЃРїРѕР»СЊР·СѓР№С‚Рµ forEach 
      "default-case": [
          "error",
          {
              "commentPattern": "^skip\\sdefault"
          }
      ], // Р·Р°РїСЂРµС‰Р°РµС‚ РЅРµ СѓРєР°Р·С‹РІР°С‚СЊ default СЂРµРіРёСЃС‚СЂ РІ switch Р·Р°СЏРІР»РµРЅРёСЏС…. Р•СЃР»Рё СѓРєР°Р·Р°С‚СЊ РєРѕРјРјРµРЅС‚Р°СЂРёР№ // skip default, С‚Рѕ default РјРѕР¶РЅРѕ РЅРµ РїСЂРѕРїРёСЃС‹РІР°С‚СЊ 
      "curly": "error", // РїСЂРµРґСѓРїСЂРµР¶РґР°РµС‚, РєРѕРіРґР° if, else, for, while, РёР»Рё do РёСЃРїРѕР»СЊР·СѓСЋС‚СЃСЏ Р±РµР· С„РёРіСѓСЂРЅС‹С… СЃРєРѕР±РѕРє 
      "dot-notation": "error", // РЅР°РїСЂР°РІР»РµРЅРѕ РЅР° РїРѕРґРґРµСЂР¶Р°РЅРёРµ СЃРѕРіР»Р°СЃРѕРІР°РЅРЅРѕСЃС‚Рё РєРѕРґР° Рё СѓР»СѓС‡С€РµРЅРёРµ С‡РёС‚Р°Р±РµР»СЊРЅРѕСЃС‚Рё РєРѕРґР° РїСѓС‚РµРј РїРѕРѕС‰СЂРµРЅРёСЏ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ СЃС‚РёР»СЏ С‚РѕС‡РµС‡РЅРѕР№ РЅРѕС‚Р°С†РёРё, РєРѕРіРґР° СЌС‚Рѕ РІРѕР·РјРѕР¶РЅРѕ 
      "no-alert": "error", //  Р±СѓРґРµС‚ РїСЂРµРґСѓРїСЂРµР¶РґР°С‚СЊ, РєРѕРіРґР° РѕРЅ СЃС‚Р°Р»РєРёРІР°РµС‚СЃСЏ c alert, prompt Рё confirm 
      "eqeqeq": [
          "error",
          "always"
      ], // СѓСЃС‚СЂР°РЅРµРЅРёРµ РЅРµР±РµР·РѕРїР°СЃРЅС‹С… РѕРїРµСЂР°С‚РѕСЂРѕРІ СЂР°РІРµРЅСЃС‚РІР° 
      "no-empty-function": "error", // СѓСЃС‚СЂР°РЅРµРЅРёРµ РїСѓСЃС‚С‹С… С„СѓРЅРєС†РёР№
      "no-eq-null": "error", // СЃСЂР°РІРЅРµРЅРёСЏ СЃ null 
      "no-fallthrough": "error", // СѓСЃС‚СЂР°РЅСЏРµС‚ case Р±РµР· break 
      "no-floating-decimal": "error", // СѓСЃС‚СЂР°РЅРµРЅРёРµ РїР»Р°РІР°СЋС‰РёС… РґРµСЃСЏС‚РёС‡РЅС‹С… С‚РѕС‡РµРє Рё Р±СѓРґРµС‚ РїСЂРµРґСѓРїСЂРµР¶РґР°С‚СЊ РІСЃСЏРєРёР№ СЂР°Р·, РєРѕРіРґР° С‡РёСЃР»РѕРІРѕРµ Р·РЅР°С‡РµРЅРёРµ РёРјРµРµС‚ РґРµСЃСЏС‚РёС‡РЅСѓСЋ С‚РѕС‡РєСѓ, РЅРѕ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚ С‡РёСЃР»Рѕ РґРѕ РёР»Рё РїРѕСЃР»Рµ РЅРµРіРѕ 
      "no-global-assign": "error", // Р­С‚Рѕ РїСЂР°РІРёР»Рѕ Р·Р°РїСЂРµС‰Р°РµС‚ РёР·РјРµРЅРµРЅРёРµ РіР»РѕР±Р°Р»СЊРЅС‹С… РїРµСЂРµРјРµРЅРЅС‹С…, РєРѕС‚РѕСЂС‹Рµ С‚РѕР»СЊРєРѕ РґР»СЏ С‡С‚РµРЅРёСЏ (Object, undefined, window, length, top, const a)
      "no-implicit-coercion": "error", // РїСЂРµРґРЅР°Р·РЅР°С‡РµРЅРѕ РґР»СЏ РѕР±РѕР·РЅР°С‡РµРЅРёСЏ Р±РѕР»РµРµ РєРѕСЂРѕС‚РєРёС… Рё РїРѕРЅСЏС‚РЅС‹С… РѕР±РѕР·РЅР°С‡РµРЅРёР№ РґР»СЏ РїСЂРµРѕР±СЂР°Р·РѕРІР°РЅРёСЏ С‚РёРїРѕРІ (Boolean, Number, String) 
      "no-magic-numbers": ["error", {"ignore": [0]}], //  СЃРґРµР»Р°С‚СЊ РєРѕРґ Р±РѕР»РµРµ С‡РёС‚Р°Р±РµР»СЊРЅС‹Рј Рё СѓРїСЂРѕСЃС‚РёС‚СЊ СЂРµС„Р°РєС‚РѕСЂРёРЅРі, РіР°СЂР°РЅС‚РёСЂСѓСЏ, С‡С‚Рѕ СЃРїРµС†РёР°Р»СЊРЅС‹Рµ С‡РёСЃР»Р° РѕР±СЉСЏРІР»СЏСЋС‚СЃСЏ РєР°Рє РєРѕРЅСЃС‚Р°РЅС‚С‹, С‡С‚РѕР±С‹ СЃРґРµР»Р°С‚СЊ РёС… СЃРјС‹СЃР» СЏРІРЅС‹Рј 
      "no-loop-func": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ Р»СЋР±СѓСЋ С„СѓРЅРєС†РёСЋ РІ С†РёРєР»Рµ, РєРѕС‚РѕСЂР°СЏ СЃРѕРґРµСЂР¶РёС‚ РЅРµР±РµР·РѕРїР°СЃРЅС‹Рµ СЃСЃС‹Р»РєРё (РЅР°РїСЂРёРјРµСЂ, РЅР° РёР·РјРµРЅРµРЅРЅС‹Рµ РїРµСЂРµРјРµРЅРЅС‹Рµ РёР· РІРЅРµС€РЅРµР№ РѕР±Р»Р°СЃС‚Рё) 
      "no-implied-eval": "error", // СѓСЃС‚СЂР°РЅРµРЅРёРµ РїРѕРґСЂР°Р·СѓРјРµРІР°РµРјС‹С… eval()РїРѕСЃСЂРµРґСЃС‚РІРѕРј РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ setTimeout(), setInterval()РёР»Рё execScript(). РўР°РєРёРј РѕР±СЂР°Р·РѕРј, РѕРЅ Р±СѓРґРµС‚ РїСЂРµРґСѓРїСЂРµР¶РґР°С‚СЊ, РєРѕРіРґР° Р»СЋР±Р°СЏ С„СѓРЅРєС†РёСЏ РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ СЃРѕ СЃС‚СЂРѕРєРѕР№ РІ вЂ‹вЂ‹РєР°С‡РµСЃС‚РІРµ РїРµСЂРІРѕРіРѕ Р°СЂРіСѓРјРµРЅС‚Р°.
      "no-implicit-globals": [
          "error",
          {
              "lexicalBindings": false
          }
      ], // Р·Р°РїСЂРµС‰Р°РµС‚ РїРѕРІС‚РѕСЂРЅРѕРµ РѕР±СЉСЏРІР»РµРЅРёРµ РіР»РѕР±Р°Р»СЊРЅС‹С… РїРµСЂРµРјРµРЅРЅС‹С… С‚РѕР»СЊРєРѕ РґР»СЏ С‡С‚РµРЅРёСЏ Рё РїСЂРёСЃРІРѕРµРЅРёРµ РіР»РѕР±Р°Р»СЊРЅС‹Рј РїРµСЂРµРјРµРЅРЅС‹Рј С‚РѕР»СЊРєРѕ РґР»СЏ С‡С‚РµРЅРёСЏ 
      "no-multi-spaces": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РјРЅРѕР¶РµСЃС‚РІРµРЅРЅС‹Рµ РїСЂРѕР±РµР»С‹ РІРѕРєСЂСѓРі Р»РѕРіРёС‡РµСЃРєРёС… РІС‹СЂР°Р¶РµРЅРёР№, СѓСЃР»РѕРІРЅС‹С… РІС‹СЂР°Р¶РµРЅРёР№, РѕР±СЉСЏРІР»РµРЅРёР№, СЌР»РµРјРµРЅС‚РѕРІ РјР°СЃСЃРёРІР°, СЃРІРѕР№СЃС‚РІ РѕР±СЉРµРєС‚Р°, РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚РµР№ Рё РїР°СЂР°РјРµС‚СЂРѕРІ С„СѓРЅРєС†РёР№ 
      "no-multi-str": "error", // РїСЂРµРґРѕС‚РІСЂР°С‰РµРЅРёРµ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ РјРЅРѕРіРѕСЃС‚СЂРѕС‡РЅС‹С… СЃС‚СЂРѕРє
      "no-new": "error", // Р·Р°РїСЂРµС‚ РІС‹Р·РѕРІРѕРІ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂР° СЃ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµРј new РєР»СЋС‡РµРІРѕРіРѕ СЃР»РѕРІР°, РєРѕС‚РѕСЂРѕРµ РЅРµ РїСЂРёСЃРІР°РёРІР°РµС‚ СЂРµР·СѓР»СЊС‚РёСЂСѓСЋС‰РёР№ РѕР±СЉРµРєС‚ РїРµСЂРµРјРµРЅРЅРѕР№ 
      "no-new-wrappers": "error", // СѓСЃС‚СЂР°РЅРµРЅРёРµ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ String, NumberРё Boolean СЃ new РѕРїРµСЂР°С‚РѕСЂРѕРј 
      "no-octal": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РѕРїСЂРµРґРµР»СЏС‚СЊ number СЃ РІРµРґСѓС‰РёРј РЅСѓР»С‘Рј (071)
      "no-redeclare": "error", // СѓСЃС‚СЂР°РЅРµРЅРёРµ РїРµСЂРµРјРµРЅРЅС‹С…, РєРѕС‚РѕСЂС‹Рµ РёРјРµСЋС‚ РЅРµСЃРєРѕР»СЊРєРѕ РѕР±СЉСЏРІР»РµРЅРёР№ РІ РѕРґРЅРѕР№ Рё С‚РѕР№ Р¶Рµ РѕР±Р»Р°СЃС‚Рё РІРёРґРёРјРѕСЃС‚Рё
      "no-self-assign": "error", //  СѓСЃС‚СЂР°РЅРµРЅРёРµ СЃР°РјРѕСЃС‚РѕСЏС‚РµР»СЊРЅС‹С… РЅР°Р·РЅР°С‡РµРЅРёР№ (foo = foo)
      "no-self-compare": "error", // СѓСЃС‚СЂР°РЅРµРЅРёРµ СЃСЂР°РІРЅРµРЅРёРµ РїРµСЂРµРјРµРЅРЅРѕР№ СЃ РЅРµР№ Р¶Рµ (С…===С…)
      "no-useless-return": "error", // РЅР°РїСЂР°РІР»РµРЅРѕ РЅР° С‚Рѕ, С‡С‚РѕР±С‹ СЃРѕРѕР±С‰Р°С‚СЊ Рѕ Р»РёС€РЅРёС… return СѓС‚РІРµСЂР¶РґРµРЅРёСЏС… 
      "no-void": "error", // РёСЃРєР»СЋС‡РµРЅРёРµ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ РѕРїРµСЂР°С‚РѕСЂР° void 
      "radix": "error", // РїСЂРµРґРѕС‚РІСЂР°С‰РµРЅРёРµ РЅРµРїСЂРµРґРЅР°РјРµСЂРµРЅРЅРѕРіРѕ РїСЂРµРѕР±СЂР°Р·РѕРІР°РЅРёСЏ СЃС‚СЂРѕРєРё РІ С‡РёСЃР»Рѕ 
      "require-await": "error", // РїСЂРµРґСѓРїСЂРµР¶РґР°РµС‚ Р°СЃРёРЅС…СЂРѕРЅРЅС‹Рµ С„СѓРЅРєС†РёРё, РєРѕС‚РѕСЂС‹Рµ РЅРµ РёРјРµСЋС‚ await РІС‹СЂР°Р¶РµРЅРёСЏ 
      "yoda": "error", // Р•СЃР»Рё СЌС‚Рѕ Р·РЅР°С‡РµРЅРёРµ РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ "never", С‚Рѕ СЃСЂР°РІРЅРµРЅРёСЏ РЅРёРєРѕРіРґР° РЅРµ РґРѕР»Р¶РЅС‹ СЃРѕРѕС‚РІРµС‚СЃС‚РІРѕРІР°С‚СЊ СѓСЃР»РѕРІРёСЏРј Р™РѕРґС‹ 
      "block-scoped-var": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ СЃРЅРѕРІР° РѕРїСЂРµРґРµР»СЏС‚СЊ var? РІ РґР°РЅРЅРѕР№ РѕР±Р»Р°СЃС‚Рё РІРёРґРёРјРѕСЃС‚Рё
      //*** Variables ***//
      "init-declarations": [
          "error",
          "always"
      ], // РЅРµРѕР±С…РѕРґРёРјРѕ РѕР±РµСЃРїРµС‡РёС‚СЊ РёРЅРёС†РёР°Р»РёР·Р°С†РёСЋ РїСЂРё РѕР±СЉСЏРІР»РµРЅРёРё
      "no-undef": "error", // Р›СЋР±Р°СЏ СЃСЃС‹Р»РєР° РЅР° РЅРµРѕР±СЉСЏРІР»РµРЅРЅСѓСЋ РїРµСЂРµРјРµРЅРЅСѓСЋ РІС‹Р·С‹РІР°РµС‚ РїСЂРµРґСѓРїСЂРµР¶РґРµРЅРёРµ, РµСЃР»Рё С‚РѕР»СЊРєРѕ РїРµСЂРµРјРµРЅРЅР°СЏ СЏРІРЅРѕ РЅРµ СѓРїРѕРјСЏРЅСѓС‚Р° РІ /*global ...*/РєРѕРјРјРµРЅС‚Р°СЂРёРё РёР»Рё РЅРµ СѓРєР°Р·Р°РЅР° РІ globals РєР»СЋС‡Рµ РІ С„Р°Р№Р»Рµ РєРѕРЅС„РёРіСѓСЂР°С†РёРё 
      "no-undef-init": "error", // РёСЃРєР»СЋС‡РµРЅРёРµ РѕР±СЉСЏРІР»РµРЅРёР№ РїРµСЂРµРјРµРЅРЅС‹С…, РєРѕС‚РѕСЂС‹Рµ РёРЅРёС†РёР°Р»РёР·РёСЂСѓСЋС‚СЃСЏ РІ undefined 
      "no-undefined": "error", // РёСЃРєР»СЋС‡РµРЅРёРµ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ undefined Рё, РєР°Рє С‚Р°РєРѕРІРѕРµ, РіРµРЅРµСЂРёСЂСѓРµС‚ РїСЂРµРґСѓРїСЂРµР¶РґРµРЅРёРµ РїСЂРё РєР°Р¶РґРѕРј РµРіРѕ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРё 
      "no-unused-vars": "error", // СѓСЃС‚СЂР°РЅРµРЅРёРµ РЅРµРёСЃРїРѕР»СЊР·СѓРµРјС‹С… РїРµСЂРµРјРµРЅРЅС‹С…, С„СѓРЅРєС†РёР№ Рё РїР°СЂР°РјРµС‚СЂРѕРІ С„СѓРЅРєС†РёРё 
      "no-use-before-define": "off", // РїСЂРµРґСѓРїСЂРµРґРёС‚, РєРѕРіРґР° РІСЃС‚СЂРµС‚РёС‚ СЃСЃС‹Р»РєСѓ РЅР° РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂ, РєРѕС‚РѕСЂС‹Р№ РµС‰Рµ РЅРµ Р±С‹Р» РѕР±СЉСЏРІР»РµРЅ
      "no-shadow-restricted-names": "error", // Р·Р°РїСЂРµС‰Р°РµС‚ РѕРїСЂРµРґРµР»РµРЅРёРµ NaN, Infinity, undefined...
      //*** Styling ***//
      "array-bracket-spacing": "error", // РїСЂРёРјРµРЅСЏС‚СЊ РёРЅС‚РµСЂРІР°Р»С‹ РІРЅСѓС‚СЂРё СЃРєРѕР±РѕРє РјР°СЃСЃРёРІР°
      "block-spacing": "error", // Р·Р°РїСЂРµС‰Р°С‚СЊ РёР»Рё РїСЂРёРјРµРЅСЏС‚СЊ РїСЂРѕР±РµР»С‹ РІРЅСѓС‚СЂРё РѕРґРЅРѕСЃС‚СЂРѕС‡РЅС‹С… Р±Р»РѕРєРѕРІ
      //"brace-style": "error", // РїСЂРёРјРµРЅСЏС‚СЊ РѕРґРёРЅ РЅР°СЃС‚РѕСЏС‰РёР№ СЃС‚РёР»СЊ СЃРєРѕР±РѕРє
      "camelcase": "error", // С‚СЂРµР±РѕРІР°С‚СЊ camelCase
      //"comma-spacing": "error", // СѓСЃС‚Р°РЅРѕРІРёС‚СЊ РёРЅС‚РµСЂРІР°Р» РґРѕ Рё РїРѕСЃР»Рµ Р·Р°РїСЏС‚РѕР№
      //"comma-style": "error", // РїСЂРёРјРµРЅСЏС‚СЊ РѕРґРёРЅ РЅР°СЃС‚РѕСЏС‰РёР№ СЃС‚РёР»СЊ Р·Р°РїСЏС‚РѕР№
      "computed-property-spacing": "error", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ Р·Р°РїРѕР»РЅРµРЅРёРµ РІРЅСѓС‚СЂРё РІС‹С‡РёСЃР»СЏРµРјС‹С… СЃРІРѕР№СЃС‚РІ
      "consistent-this": "error", // РѕР±РµСЃРїРµС‡РёС‚СЊ СЃРѕРіР»Р°СЃРѕРІР°РЅРЅРѕРµ РёРјРµРЅРѕРІР°РЅРёРµ РїСЂРё Р·Р°С…РІР°С‚Рµ С‚РµРєСѓС‰РµРіРѕ РєРѕРЅС‚РµРєСЃС‚Р° РІС‹РїРѕР»РЅРµРЅРёСЏ
      "eol-last": "off", // РїСЂРёРјРµРЅСЏС‚СЊ РЅРѕРІСѓСЋ СЃС‚СЂРѕРєСѓ РІ РєРѕРЅС†Рµ С„Р°Р№Р»Р°, Р±РµР· РЅРµСЃРєРѕР»СЊРєРёС… РїСѓСЃС‚С‹С… СЃС‚СЂРѕРє
      "func-names": "error", // С‚СЂРµР±РѕРІР°С‚СЊ, С‡С‚РѕР±С‹ РІС‹СЂР°Р¶РµРЅРёСЏ С„СѓРЅРєС†РёР№ РёРјРµР»Рё РёРјСЏ
      "id-length": "error", // СЌС‚Р° РѕРїС†РёСЏ РѕР±РµСЃРїРµС‡РёРІР°РµС‚ РјРёРЅРёРјР°Р»СЊРЅСѓСЋ Рё РјР°РєСЃРёРјР°Р»СЊРЅСѓСЋ РґР»РёРЅСѓ РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂР° (РёРјРµРЅР° РїРµСЂРµРјРµРЅРЅС‹С…, РёРјРµРЅР° СЃРІРѕР№СЃС‚РІ Рё С‚. Рґ.)
      "id-match": "error", // С‚СЂРµР±РѕРІР°С‚СЊ РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂС‹, С‡С‚РѕР±С‹ СЃРѕРѕС‚РІРµС‚СЃС‚РІРѕРІР°С‚СЊ РїСЂРµРґРѕСЃС‚Р°РІР»РµРЅРЅРѕРµ СЂРµРіСѓР»СЏСЂРЅРѕРµ РІС‹СЂР°Р¶РµРЅРёРµ
      "id-blacklist": "error", // С‡РµСЂРЅС‹Р№ СЃРїРёСЃРѕРє РѕРїСЂРµРґРµР»РµРЅРЅС‹С… РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂРѕРІ, С‡С‚РѕР±С‹ РїСЂРµРґРѕС‚РІСЂР°С‚РёС‚СЊ РёС… РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ
      "indent": [
          "error",
          4
      ], // СѓРєР°Р¶РёС‚Рµ С€РёСЂРёРЅСѓ С‚Р°Р±СѓР»СЏС†РёРё РёР»Рё РїСЂРѕР±РµР»Р° РґР»СЏ РІР°С€РµРіРѕ РєРѕРґР°
      "jsx-quotes": "error", // СѓРєР°Р¶РёС‚Рµ, СЃР»РµРґСѓРµС‚ Р»Рё РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РґРІРѕР№РЅС‹Рµ РёР»Рё РѕРґРёРЅР°СЂРЅС‹Рµ РєР°РІС‹С‡РєРё РІ Р°С‚СЂРёР±СѓС‚Р°С… JSX
      //"key-spacing": "error", // РїСЂРёРјРµРЅСЏС‚СЊ РёРЅС‚РµСЂРІР°Р» РјРµР¶РґСѓ РєР»СЋС‡Р°РјРё Рё Р·РЅР°С‡РµРЅРёСЏРјРё РІ СЃРІРѕР№СЃС‚РІР°С… Р»РёС‚РµСЂР°Р»РѕРІ РѕР±СЉРµРєС‚Р°
      "keyword-spacing": "off", // РїСЂРёРјРµРЅСЏС‚СЊ РёРЅС‚РµСЂРІР°Р»С‹ РґРѕ Рё РїРѕСЃР»Рµ РєР»СЋС‡РµРІС‹С… СЃР»РѕРІ
      "lines-around-comment": "error", // РїСЂРёРјРµРЅСЏС‚СЊ РїСѓСЃС‚С‹Рµ СЃС‚СЂРѕРєРё РІРѕРєСЂСѓРі РєРѕРјРјРµРЅС‚Р°СЂРёРµРІ
      "max-depth": "error", // СѓРєР°Р·Р°С‚СЊ РјР°РєСЃРёРјР°Р»СЊРЅСѓСЋ РіР»СѓР±РёРЅСѓ, РЅР° РєРѕС‚РѕСЂСѓСЋ РјРѕРіСѓС‚ Р±С‹С‚СЊ РІР»РѕР¶РµРЅС‹ Р±Р»РѕРєРё
      "max-nested-callbacks": "error", // СѓРєР°Р·Р°С‚СЊ РјР°РєСЃРёРјР°Р»СЊРЅСѓСЋ РіР»СѓР±РёРЅСѓ РѕР±СЂР°С‚РЅРѕРіРѕ РІС‹Р·РѕРІР° РјРѕР¶РµС‚ Р±С‹С‚СЊ РІР»РѕР¶РµРЅРЅС‹Рј
      "max-params": "off", // РѕРіСЂР°РЅРёС‡РёРІР°РµС‚ РєРѕР»РёС‡РµСЃС‚РІРѕ РїР°СЂР°РјРµС‚СЂРѕРІ, РєРѕС‚РѕСЂС‹Рµ РјРѕРіСѓС‚ Р±С‹С‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅС‹ РІ РѕР±СЉСЏРІР»РµРЅРёРё С„СѓРЅРєС†РёРё
      "max-statements": "off", // СѓРєР°Р·Р°С‚СЊ РјР°РєСЃРёРјР°Р»СЊРЅРѕ РґРѕРїСѓСЃС‚РёРјРѕРµ РєРѕР»РёС‡РµСЃС‚РІРѕ РѕРїРµСЂР°С‚РѕСЂРѕРІ РІ С„СѓРЅРєС†РёРё
      "new-cap": "error", // С‚СЂРµР±СѓРµС‚СЃСЏ Р·Р°РіР»Р°РІРЅР°СЏ Р±СѓРєРІР° РґР»СЏ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂРѕРІ
      "new-parens": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РїСЂРѕРїСѓСЃРє РєСЂСѓРіР»С‹С… СЃРєРѕР±РѕРє РїСЂРё РІС‹Р·РѕРІРµ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂР° Р±РµР· Р°СЂРіСѓРјРµРЅС‚РѕРІ
      "newline-after-var": "error", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ РїСѓСЃС‚РѕР№ СЃРёРјРІРѕР» РЅРѕРІРѕР№ СЃС‚СЂРѕРєРё РїРѕСЃР»Рµ РѕР±СЉСЏРІР»РµРЅРёСЏ РїРµСЂРµРјРµРЅРЅС‹С…
      "newline-per-chained-call": "error", // РІРІРѕРґРёС‚СЊ РЅРѕРІСѓСЋ СЃС‚СЂРѕРєСѓ РїРѕСЃР»Рµ РєР°Р¶РґРѕРіРѕ РІС‹Р·РѕРІР° РїСЂРё РѕР±СЉРµРґРёРЅРµРЅРёРё РІС‹Р·РѕРІРѕРІ
      "no-array-constructor": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂР° Array
      "no-bitwise": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РїРѕР±РёС‚РѕРІС‹С… РѕРїРµСЂР°С‚РѕСЂРѕРІ
      "no-continue": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РѕРїРµСЂР°С‚РѕСЂР° continue
      "no-inline-comments": "error", // Р·Р°РїСЂРµС‰Р°С‚СЊ РєРѕРјРјРµРЅС‚Р°СЂРёРё РІ СЃС‚СЂРѕРєРµ РїРѕСЃР»Рµ РєРѕРґР°
      "no-lonely-if": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ if РєР°Рє РµРґРёРЅСЃС‚РІРµРЅРЅС‹Р№ РѕРїРµСЂР°С‚РѕСЂ РІ Р±Р»РѕРєРµ else
      "no-mixed-spaces-and-tabs": "error", // Р·Р°РїСЂРµС‰Р°С‚СЊ СЃРјРµС€Р°РЅРЅС‹Рµ РїСЂРѕР±РµР»С‹ Рё РІРєР»Р°РґРєРё РґР»СЏ РѕС‚СЃС‚СѓРїР°
      "no-negated-condition": "error", // Р·Р°РїСЂРµС‰Р°С‚СЊ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹Рµ СѓСЃР»РѕРІРёСЏ
      "no-nested-ternary": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РІР»РѕР¶РµРЅРЅС‹Рµ С‚СЂРѕРёС‡РЅС‹Рµ РІС‹СЂР°Р¶РµРЅРёСЏ
      "no-new-object": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂР° Object
      "no-restricted-syntax": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РѕРїСЂРµРґРµР»РµРЅРЅРѕРіРѕ СЃРёРЅС‚Р°РєСЃРёСЃР° РІ РєРѕРґРµ
      "no-whitespace-before-property": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РїСѓСЃС‚РѕРµ РїСЂРѕСЃС‚СЂР°РЅСЃС‚РІРѕ РїРµСЂРµРґ СЃРІРѕР№СЃС‚РІР°РјРё
      "no-spaced-func": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РїСЂРѕСЃС‚СЂР°РЅСЃС‚РІРѕ РјРµР¶РґСѓ РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂРѕРј С„СѓРЅРєС†РёРё Рё РїСЂРёР»РѕР¶РµРЅРёРµРј
      "no-ternary": "off", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ С‚РµСЂРЅР°СЂРЅС‹С… РѕРїРµСЂР°С‚РѕСЂРѕРІ
      "no-underscore-dangle": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РІРёСЃСЏС‰РёРµ РїРѕРґС‡РµСЂРєРёРІР°РЅРёСЏ РІ РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂР°С…
      "no-unneeded-ternary": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ С‚СЂРѕРёС‡РЅС‹С… РѕРїРµСЂР°С‚РѕСЂРѕРІ, РєРѕРіРґР° СЃСѓС‰РµСЃС‚РІСѓРµС‚ Р±РѕР»РµРµ РїСЂРѕСЃС‚Р°СЏ Р°Р»СЊС‚РµСЂРЅР°С‚РёРІР°
      "object-curly-spacing": "off", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ Р·Р°РїРѕР»РЅРµРЅРёРµ РІРЅСѓС‚СЂРё С„РёРіСѓСЂРЅС‹С… СЃРєРѕР±РѕРє
      "one-var": "off", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ РѕРґРЅРѕ РѕР±СЉСЏРІР»РµРЅРёРµ РїРµСЂРµРјРµРЅРЅРѕР№ РґР»СЏ С„СѓРЅРєС†РёРё
      "one-var-declaration-per-line": "error", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ РїРµСЂРµРІРѕРґ СЃС‚СЂРѕРєРё РІРѕРєСЂСѓРі РѕР±СЉСЏРІР»РµРЅРёР№ РїРµСЂРµРјРµРЅРЅС‹С…
      "operator-assignment": "error", // РїРѕ РІРѕР·РјРѕР¶РЅРѕСЃС‚Рё С‚СЂРµР±РѕРІР°С‚СЊ РѕРїРµСЂР°С‚РѕСЂР° РїСЂРёСЃРІР°РёРІР°РЅРёСЏ РёР»Рё РїРѕР»РЅРѕСЃС‚СЊСЋ Р·Р°РїСЂРµС‰Р°С‚СЊ
      "operator-linebreak": "error", // РїСЂРёРЅСѓРґРёС‚РµР»СЊРЅРѕ СЂР°Р·РјРµС‰Р°С‚СЊ РѕРїРµСЂР°С‚РѕСЂС‹ РґРѕ РёР»Рё РїРѕСЃР»Рµ СЂР°Р·СЂС‹РІР° СЃС‚СЂРѕРєРё
      "padded-blocks": "off", // РѕР±РµСЃРїРµС‡РёС‚СЊ Р·Р°РїРѕР»РЅРµРЅРёРµ РІРЅСѓС‚СЂРё Р±Р»РѕРєРѕРІ
      "quote-props": "off", // С‚СЂРµР±РѕРІР°С‚СЊ РєР°РІС‹С‡РєРё РІРѕРєСЂСѓРі РёРјРµРЅ Р»РёС‚РµСЂР°Р»СЊРЅС‹С… СЃРІРѕР№СЃС‚РІ РѕР±СЉРµРєС‚Р°
      //"quotes": "off", // СѓРєР°Р¶РёС‚Рµ, СЃР»РµРґСѓРµС‚ Р»Рё РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РѕР±СЂР°С‚РЅС‹Рµ РєР°РІС‹С‡РєРё, РґРІРѕР№РЅС‹Рµ РёР»Рё РѕРґРёРЅР°СЂРЅС‹Рµ РєР°РІС‹С‡РєРё
      "require-jsdoc": "off", // РўСЂРµР±РѕРІР°С‚СЊ РєРѕРјРјРµРЅС‚Р°СЂРёР№ JSDoc
      "sort-vars": "error", // СЃРѕСЂС‚РёСЂРѕРІР°С‚СЊ РїРµСЂРµРјРµРЅРЅС‹Рµ РІ РїСЂРµРґРµР»Р°С… РѕРґРЅРѕРіРѕ Р±Р»РѕРєР° РѕР±СЉСЏРІР»РµРЅРёСЏ
      "sort-imports": "off", // СЃРѕСЂС‚РёСЂРѕРІР°С‚СЊ РѕР±СЉСЏРІР»РµРЅРёСЏ РёРјРїРѕСЂС‚Р° РІ РјРѕРґСѓР»Рµ
      "space-before-blocks": "error", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ РїСЂРѕСЃС‚СЂР°РЅСЃС‚РІРѕ РїРµСЂРµРґ Р±Р»РѕРєР°РјРё
      "space-in-parens": "error", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ РїСЂРѕР±РµР»С‹ РІ СЃРєРѕР±РєР°С…
      "space-unary-ops": "error", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ РїСЂРѕР±РµР»С‹ РґРѕ / РїРѕСЃР»Рµ СѓРЅР°СЂРЅС‹С… РѕРїРµСЂР°С‚РѕСЂРѕРІ
      "spaced-comment": "error", // С‚СЂРµР±РѕРІР°С‚СЊ РёР»Рё Р·Р°РїСЂРµС‰Р°С‚СЊ РїСЂРѕР±РµР» СЃСЂР°Р·Сѓ РїРѕСЃР»Рµ // РёР»Рё / * РІ РєРѕРјРјРµРЅС‚Р°СЂРёРё
      "wrap-regex": "error", // С‚СЂРµР±СѓРµС‚, С‡С‚РѕР±С‹ Р»РёС‚РµСЂР°Р»С‹ СЂРµРіСѓР»СЏСЂРЅС‹С… РІС‹СЂР°Р¶РµРЅРёР№ Р±С‹Р»Рё Р·Р°РєР»СЋС‡РµРЅС‹ РІ СЃРєРѕР±РєРё
      //"comma-dangle": "off", // С‚СЂРµР±СѓРµС‚ СѓРґР°Р»СЏС‚СЊ РїРѕСЃР»РµРґРЅСЋСЋ Р·Р°РїСЏС‚СѓСЋ РІ Р°СЂРіСѓРјРµРЅС‚Р°С… С„СѓРЅРєС†РёРё
      //*** ECMAScript 6 ***//
      //"arrow-spacing": "error", // С‚СЂРµР±СѓРµС‚СЃСЏ РїСЂРѕР±РµР» РґРѕ / РїРѕСЃР»Рµ СЃС‚СЂРµР»РєРё С„СѓРЅРєС†РёРё СЃС‚СЂРµР»РєРё
      "constructor-super": "error", // РїСЂРѕРІРµСЂСЏС‚СЊ РІС‹Р·РѕРІС‹ super () РІ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂР°С…
      "generator-star-spacing": ["error", {"before": false, "after": true}], // РѕР±РµСЃРїРµС‡РёС‚СЊ РёРЅС‚РµСЂРІР°Р» РІРѕРєСЂСѓРі * РІ С„СѓРЅРєС†РёСЏС… РіРµРЅРµСЂР°С‚РѕСЂР° 
      "no-class-assign": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёР·РјРµРЅРµРЅРёРµ РїРµСЂРµРјРµРЅРЅС‹С… РѕР±СЉСЏРІР»РµРЅРёР№ РєР»Р°СЃСЃР°
      "no-confusing-arrow": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ С„СѓРЅРєС†РёРё СЃС‚СЂРµР»РѕРє, РіРґРµ РёС… РјРѕР¶РЅРѕ СЃРїСѓС‚Р°С‚СЊ СЃРѕ СЃСЂР°РІРЅРµРЅРёСЏРјРё
      "no-const-assign": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёР·РјРµРЅРµРЅРёРµ РїРµСЂРµРјРµРЅРЅС‹С…, РѕР±СЉСЏРІР»РµРЅРЅС‹С… СЃ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµРј 
      "no-dupe-class-members": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РґСѓР±Р»РёСЂРѕРІР°РЅРёРµ РёРјРµРЅРё РІ РєР»Р°СЃСЃРµ
      "no-new-symbol": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РЅРѕРІРѕРіРѕ РѕРїРµСЂР°С‚РѕСЂР° СЃ РѕР±СЉРµРєС‚РѕРј Symbol
      "no-this-before-super": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ this / super РїРµСЂРµРґ РІС‹Р·РѕРІРѕРј super () РІ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂР°С…
      "no-var": "error", // РўСЂРµР±СѓРµС‚СЃСЏ РїСѓСЃС‚СЊ РёР»Рё const РІРјРµСЃС‚Рѕ VAR
      "no-useless-constructor": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ РЅРµРЅСѓР¶РЅС‹Р№ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂ
      "object-shorthand": "error", // С‚СЂРµР±СѓРµС‚СЃСЏ СЃРѕРєСЂР°С‰РµРЅРЅС‹Р№ СЃРёРЅС‚Р°РєСЃРёСЃ РјРµС‚РѕРґР° Рё СЃРІРѕР№СЃС‚РІР° РґР»СЏ РѕР±СЉРµРєС‚РЅС‹С… Р»РёС‚РµСЂР°Р»РѕРІ
      "prefer-arrow-callback": "error", // РїСЂРµРґР»РѕР¶РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ С„СѓРЅРєС†РёРё СЃС‚СЂРµР»РѕРє РІ РєР°С‡РµСЃС‚РІРµ РѕР±СЂР°С‚РЅС‹С… РІС‹Р·РѕРІРѕРІ
      "prefer-const": "error", // РїСЂРµРґР»РѕР¶РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РѕР±СЉСЏРІР»РµРЅРёРµ const РґР»СЏ РїРµСЂРµРјРµРЅРЅС‹С…, РєРѕС‚РѕСЂС‹Рµ РЅРёРєРѕРіРґР° РЅРµ РёР·РјРµРЅСЏСЋС‚СЃСЏ РїРѕСЃР»Рµ РѕР±СЉСЏРІР»РµРЅРёСЏ
      "prefer-reflect": "off", // РїСЂРµРґР»РѕР¶РёС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РјРµС‚РѕРґС‹ Reflect, РіРґРµ СЌС‚Рѕ РїСЂРёРјРµРЅРёРјРѕ
      "prefer-rest-params": "error", // РїСЂРµРґР»РѕР¶РёС‚Рµ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РѕСЃС‚Р°Р»СЊРЅС‹Рµ РїР°СЂР°РјРµС‚СЂС‹ РІРјРµСЃС‚Рѕ Р°СЂРіСѓРјРµРЅС‚РѕРІ
      "prefer-spread": "error", // РїСЂРµРґР»РѕР¶РёС‚Рµ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РѕРїРµСЂР°С‚РѕСЂ СЂР°СЃРїСЂРѕСЃС‚СЂР°РЅРµРЅРёСЏ РІРјРµСЃС‚Рѕ .apply ()
      "prefer-template": "error", // РїСЂРµРґР»РѕР¶РёС‚Рµ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ Р»РёС‚РµСЂР°Р»С‹ С€Р°Р±Р»РѕРЅР° РІРјРµСЃС‚Рѕ РєРѕРЅРєР°С‚РµРЅР°С†РёРё СЃС‚СЂРѕРє
      "require-yield": "error", // Р·Р°РїСЂРµС‚РёС‚СЊ С„СѓРЅРєС†РёРё РіРµРЅРµСЂР°С‚РѕСЂР°, РєРѕС‚РѕСЂС‹Рµ РЅРµ РёРјРµСЋС‚ РІС‹С…РѕРґР°
      "template-curly-spacing": "error", // РїСЂРёРјРµРЅСЏС‚СЊ РёРЅС‚РµСЂРІР°Р» РІРѕРєСЂСѓРі РІСЃС‚СЂРѕРµРЅРЅС‹С… РІС‹СЂР°Р¶РµРЅРёР№ С€Р°Р±Р»РѕРЅРЅС‹С… СЃС‚СЂРѕРє
      "yield-star-spacing": "error" // РїСЂРёРјРµРЅСЏС‚СЊ РёРЅС‚РµСЂРІР°Р» РІРѕРєСЂСѓРі РІС‹СЂР°Р¶РµРЅРёР№ * in yield *
      
  },
};